In [2]:
import pandas as pd

print(pd.__version__)

1.2.4

In [3]:
# Pandas 25 | Pengaturan tampilan pada Python Pandas | display option

In [ ]:
df = pd.read_csv('./data/titanicfill.csv')
df

In [5]:
# Pengaturan Tampilan

In [ ]:
pd.set_option('display.max_rows', 5)
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_colwidght', 20)

df

In [ ]:
pd.reset_option('^display.', silent = True)

df

In [ ]:
pf.describe_option()

In [ ]:
# Pandas 26 | Membuat Data Frame dari hasil seleksi Spreadsheet

In [6]:
df = pd.read_clipboard()
df

       NIM  Nama
0  7218123  Tejo
1  7218162  Bejo
2  7218462   Adi

In [7]:
# Pandas 27 | Fungsi agregasi first dan last pada Python Pandas

In [9]:
d = {'dokter':['Budi', 'Wati', 'Iwan', 'Budi','Budi', 'Wati'],
     'pasien':['Abdul', 'Rahmat', 'Asep', 'Joko', 'Winwin', 'Lisa']}

df = pd.DataFrame(d)
df

  dokter  pasien
0   Budi   Abdul
1   Wati  Rahmat
2   Iwan    Asep
3   Budi    Joko
4   Budi  Winwin
5   Wati    Lisa

In [ ]:
# Mengenal fungsi agregasi first() dan last()

In [10]:
df.groupby('dokter')['pasien'].count().to_frame()

        pasien
dokter
Budi         3
Iwan         1
Wati         2

In [11]:
df.groupby('dokter')['pasien'].first().to_frame()

        pasien
dokter
Budi     Abdul
Iwan      Asep
Wati    Rahmat

In [12]:
df.groupby('dokter')['pasien'].last().to_frame()

        pasien
dokter
Budi    Winwin
Iwan      Asep
Wati      Lisa

In [ ]:
# Pandas 28 | Mengenal Explode dan implode List pada Pandas Data Frame

In [13]:
d = {'Team':['DC', 'Marvel'],
     'Heroes':[['Batman', 'Superman', 'Wonder Woman', 'Aquaman', 'Green Lantern', 'Shazam'],
              ['Iron Man', 'Captain America', 'Ant-Man', 'Black Panther', 'Captain Marvel']]}

df = pd.DataFrame(d)
df

     Team                                             Heroes
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...

In [ ]:
# Explode

In [14]:
df1 = df.explode('Heroes')
df1

     Team           Heroes
0      DC           Batman
0      DC         Superman
0      DC     Wonder Woman
0      DC          Aquaman
0      DC    Green Lantern
0      DC           Shazam
1  Marvel         Iron Man
1  Marvel  Captain America
1  Marvel          Ant-Man
1  Marvel    Black Panther
1  Marvel   Captain Marvel

In [ ]:
# Implode

In [15]:
d = {'Team':['DC', 'Marvel']}
df2 = pd.DataFrame(d)
df2

     Team
0      DC
1  Marvel

In [16]:
df2['Imploded'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2

     Team                                           Imploded
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...